// Задача 64: Задайте значение N. Напишите программу, 
// которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

Console.Clear();
Console.Write("Задайте число N: ");
int n = Convert.ToInt32(Console.ReadLine());

Console.Write($"N = {n} -> {NatureNumb(n)}");


string NatureNumb(int numb)
{
    if (numb == 1) return Convert.ToString(numb);
    return numb + ", " + NatureNumb(numb-1);
}



/*=========================================
Результат (вариант1):
===========================================

Задайте число N: 8
N = 8 -> 8, 7, 6, 5, 4, 3, 2, 1

===========================================*/